<?php

return [
    'list_created' => 'Список покупок успешно создан.',
    'list_updated' => 'Список покупок успешно обновлён.',
    'list_deleted' => 'Список покупок удалён.',

    'cannot_add_owner_as_participant' => 'Нельзя добавить владельца как участника.',
    'cannot_remove_owner' => 'Нельзя удалить владельца из списка.',

    'participant_added' => 'Участник успешно добавлен в список.',
    'participant_removed' => 'Участник удалён из списка.',

    'item_created' => 'Пункт списка покупок успешно добавлен.',
    'item_updated' => 'Пункт списка покупок успешно обновлён.',
    'item_deleted' => 'Пункт списка покупок удалён.',
];
